package test.java.task_SLE_LangChuang;

/**
 * Created with IntelliJ IDEA
 * User:huangming
 * Date:2017/10/23
 * Time:下午5:05
 */
public class BaseInfo_Title_ListValue_DBCondition {
     //Excel表头
    public static  String titleLCShengYanRuZB="医院,患者（PID）,出生年,SLE时间天,SLE病历（RID）,胰腺癌诊断名称,SLE年龄,最早记录时间天,入院前病程,最晚记录时间天,观察期终点,确诊SLE后病程分组,糖尿病时间天,糖尿病病历（RID）,糖尿病诊断名称,糖尿病年龄,糖尿病分组,肾损害时间天,肾损害病历（RID）,肾损害名称,肾损害年龄,肾损害分组,狼疮性肾炎时间天,狼疮性肾炎实体,狼疮性肾炎状态,狼疮性肾炎病历（RID）,狼疮性肾炎名称,狼疮性肾炎年龄,狼疮性肾炎分组,入组判定" ;
    public static String titleLCShengYanYinShuB="医院,患者（PID）,出生年,性别,地域,观察期终点,SLE时间天,SLE年龄,SLE年龄分组,初发时间天,初发年龄,初发年龄分组,确诊时间天,狼疮性肾炎时间天,狼疮性肾炎分组,最终分组";
    public static String titleLCShengYanYinShuB1="患者（PID）,最终分组,医院,出生年,性别,地域,SLE诊断年,SLE年龄,SLE年龄分组,初发年,初发年龄,初发年龄分组,确诊时间天";
    public static String titleLCShengYanYinShuB2="患者（PID）,最终分组,医院,出生年,性别,地域,SLE诊断年,SLE年龄,SLE年龄分组,初发年,初发年龄,初发年龄分组,确诊时间天";
    public static String titleLCShengYanYinShuB3="患者（PID）,最终分组,医院,出生年,性别,地域,SLE诊断年,SLE年龄,SLE年龄分组,初发年,初发年龄,初发年龄分组,确诊时间天";
    public static String titleLCShengYanYinShuB4="患者（PID）,最终分组,医院,出生年,性别,地域,SLE诊断年,SLE年龄,SLE年龄分组,初发年,初发年龄,初发年龄分组,确诊时间天";
    public static String titleLCShengYanYinShuB5="患者（PID）,最终分组,医院,出生年,性别,地域,SLE诊断年,SLE年龄,SLE年龄分组,初发年,初发年龄,初发年龄分组,确诊时间天";
    public static String tiltlePIDChouYangB="患者（PID）,性别,出生年rid,出生年,实体类型,RID,锚点,实体名称,实体标准名,状态1,状态2,时间,时间天,实体年龄,初发表现标注,对标观察项目,子项,拟观察系统累及分组";
    public static String tiltleXitongleiji="医院,患者（PID）,出生年,性别,地域,最晚记录时间天,对标观察项目,累及表现,累及rid,表型,锚点,上下文,累及时间天,累及时间年减去出生年,初发时间天,初发年龄,初发年龄分组,累及时间天减去初发时间天,最晚记录时间天减去初发时间天,首诊时间天,首诊年龄,首诊年龄分组,累及时间天减去首诊时间天,确诊时间,病程天,病程年";
    public static String tiltleChuFaleiji="医院,患者（PID）,出生年,性别,地域,最晚记录时间天,子项,拟观察系统累及分组,子项表现,子项rid,表型,锚点,上下文,子项时间天,子项时间年减去出生年,初发时间天,初发年龄,初发年龄分组,子项时间天减去初发时间天,最晚记录时间天减去初发时间天,首诊时间天,首诊年龄,首诊年龄分组,子项时间天减去首诊时间天,确诊时间,生产状况分组";
    public static String tiltlePingFenTable="患者（PID）,最终得分,得分分组,ANA评分标记,ANA评分标记时间天,ANA评分标记名称,ANA评分标记RID,医院,出生年,性别,地域,SLE首诊时间天,SLE年龄,SLE年龄分组";
    public static String titleWPSEntityStatistic="医院,患者数,男性患者数,女性患者数,病历数,入院病历数,出院病历数,最早病历时间,最晚病历时间,基本信息表型数,诊断表型数,用药表型数,化验表型数,症状体征表型数";
    public static String tiltleLeiJiFenZu="频次,表型,表型名称,标准标本,对标观察项目,子项,拟观察系统累及分组,2017诊断评分一级,2017诊断评分二级,2017诊断评分标记";
    public static String titleSleBiaoXianB="患者（PID）,医院,出生年,性别,地域,首诊时间天,首诊年龄,首诊年龄分组";
    public static String titleSleLeiJiB="患者（PID）,医院,出生年,性别,地域,首诊时间天,首诊年龄,首诊年龄分组,最晚记录时间天,病程天,病程年";
    //查询列表

    public static  String condHYLangChuangShengYan="'24小时尿蛋白定量试验','尿蛋白定性试验','尿蛋白/肌酐比值','管型'";
    public static  String condHYShengShunHai="'24小时尿蛋白定量试验','尿蛋白定性试验','尿蛋白/肌酐比值','肌酐','管型'";
    public static  String condZDTangNiaoB="'糖尿病','2型糖尿病','类固醇性糖尿病','特指糖尿病','继发性糖尿病','糖尿病性肾病','DM','妊娠期糖尿病','糖尿病酮症','糖尿病性白内障','1型糖尿病','医源性糖尿病','糖尿病性酮症酸中毒','dm','结节性糖尿病肾小球硬化症','糖尿病家族史','糖尿病性心肌炎','糖尿病性足病'";
    public static  String condZDShengYan="'狼疮性肾炎','肾病综合征','肾功能不全','肾病','慢性肾功能不全','慢性肾脏病5期','肾炎(肾小球肾炎) NOS','慢性肾衰竭','慢性肾脏病3期','蛋白尿','急性肾衰竭','腹膜透析','慢性肾脏病1期','急性肾功能不全','慢性肾炎','血液透析','肾透析','膜性肾病','慢性肾脏病4期','肾衰竭','慢性肾病-II期','尿毒症','慢性肾小球肾炎','慢性肾功能衰竭','慢性肾炎综合征','慢性肾脏病2期','急性肾炎','系膜增生性肾小球肾炎','慢性肾脏病','IgA肾病','系统性红斑狼疮肾','急进性肾炎','急性肾小球肾炎','右颈内静脉留置带涤纶套透析导管','系膜增生性肾炎','维持性血透','肾功能异常','慢性肾功能衰竭,尿毒症期','急性肾功能损害','狼疮性肾炎血液系统受累','过敏性紫癜性肾炎','腹膜透析导管留置状态','弥漫增生性合并膜性狼疮性肾炎','蛋白尿，局灶性节段性肾小球硬化','右颈内静脉留置长期透析导管','膜增殖性肾小球肾炎','新月体性肾小球肾炎','腹膜透析后腹膜炎','右颈内静脉留置临时透析导管','新月体肾炎','持续性非卧床腹膜透析','肾炎综合症','狼疮肾炎IV（A/G）型','狼疮累及肾脏','急性间质性肾炎','右股静脉留置临时透析导管','肾功能失代偿期','急性肾功能损伤','快速进展型肾衰竭','系膜增殖性肾小球肾炎','狼疮性肾炎（Ⅳ型）改变伴节段新月体形成','间质性肾炎','增殖性肾小球肾炎','膜性肾小球肾炎','腹膜透析管移位','腹膜透析状态','狼疮性肾炎V+IV型（伴新月体形成）','狼疮性肾炎IV型（伴新月体形成）','狼疮性肾损害','急进型肾小球肾炎','ANCA相关性肾炎','狼疮间质性肾炎','腹膜透析导管出口感染','急进型肾炎综合征','移植肾功能不全','毛细血管增生性肾小球肾炎','心肾衰竭','肾透析状态','维持性血液透析状态','肾功能失代偿CKD3','狼疮性肾炎（IV-G（A/C）+Ⅴ）伴较多新月体形成','慢性肾功能不全，氮质血症期','慢性肾炎慢性肾病－V期','毛内增生性肾小球肾炎','血管炎性肾小球肾炎','膜性肾炎','慢性肾盂肾炎','肾透析的动静脉造瘘','系膜增生性肾炎伴硬化','新月体型肾小球肾炎','3型狼疮肾炎改变','慢性肾脏病5期贫血','慢性间质性肾炎','肾病综合征，膜性增生性肾小球肾炎','慢性系膜增生性肾小球肾炎','急性肾炎综合征','硬化性肾炎','急性肾功能不全（RPGN）','急性肾炎综合症','肾性贫血性肾功能不全','维持性血压透析','狼苍肾炎','透析导管相关菌血症','CRF（尿毒症）','狼疮肾炎（IV型A/G）','血液透析后','膜性增生性肾小球肾炎','腹膜透析管置入术后','狼疮性肾炎V+IV型（（伴新月体形成））'";

    //查询条件
//   public static String ADR13="'Tab_Version':'3.0','projectProcessId':{$in:[26725874,26725981,26722459,26722968,26722977,26723071,26724501,26725038,26725103,26726621,26725655,26725739,26726762]}";
    public static String ADR13="'Tab_Version':'3.0','projectProcessId':{$in:[1522592062707]}";
    public static String ADO13="'projectProcessId':{$in:[1522166312144]},'Tab_Version':'VB1.0.1'";
    public static String YiYuan13="{$in:['57b1e21fd897cd373ec7a14f']}";
    public static String YiYuanList="57b1e21fd897cd373ec7a14f";
    public static String ZZTZ13SLE="'projectProcessId':{$in:[1522166312144]},'Tab_Version':'2.0'";
    public static String ZD13SLE="'Tab_Version':'2.0','projectProcessId':{$in:[1522592062707]}";
    public static String HY13SLE="'Tab_Version':'3.03','projectProcessId':{$in:[1523362445343]}";//1522766941899,
    public static String BH13SLE="'Tab_Version':'VB1.0.1','projectProcessId':{$in:[1522166312144]}";

//    static {
//         String strpid= "'PID' : {$in:['xiangya_E1980728','7f19b34d5d4acbf09b5782297a5da66f','c9761d247f97fdfdff963c5fc05d0402']}, ";
//        ADR13=strpid+ADR13;
//        ADO13=strpid+ADO13;
//        ZZTZ13SLE=strpid+ZZTZ13SLE;
//        HY13SLE=strpid+HY13SLE;
//        ZD13SLE=strpid+ZD13SLE;
//    }
    //'标准诊断名':'胰腺癌'
    public static String strTZConditon="{"+ZZTZ13SLE+",'症状&体征时间':{$exists:true,$regex:/^.{10,}$/},'$or':[{'体征':{$ne:''}},{'体征定性描述':{$ne:''}}]}";
    public static String strTZConditon1="{"+ZZTZ13SLE+",'$or':[{'体征':{$ne:''}},{'体征定性描述':{$ne:''}}]}";
    public static String strZZConditon="{"+ZZTZ13SLE+",'症状&体征时间':{$exists:true,$regex:/^.{10,}$/},'症状1':{$exists:true,$ne:''},'否定词':''}";
    public static String strHYCondition="{"+HY13SLE+",'化验时间':{$exists:true,$regex:/^.{10,}$/}";
    public static String strShengYanZDCondition="{'诊断状态':'是','标准诊断名':{$in:["+condZDShengYan+"]},"+ZD13SLE+",'诊断时间':{$exists:true,$regex:/^.{10,}$/}}";
    public static  String strSLEZDLCCondition="{'诊断时间':{$exists:true,$regex:/^.{10,}$/},'标准诊断名':{$in:['慢性胰腺炎急性发作','慢性胰腺炎','慢性胰腺炎伴胰管结石','酒精性慢性胰腺炎','慢性胰腺炎伴结石','慢性胰腺炎伴假性囊肿','慢性胰腺炎ERCP术后','慢性胰腺炎术后','慢性胰腺炎术后复查','慢性胰腺炎伴假性囊肿形成','肿块型慢性胰腺炎','慢性胰腺炎支架置入术后','慢性胰腺炎改变','特发性慢性胰腺炎','胰头肿块型慢性胰腺炎','慢性胰腺炎（酒精性）','慢性胰腺炎胰管支架置换术后','胰头慢性胰腺炎','慢性胰腺炎伴导管上皮低级别上皮内瘤变','遗传性慢性胰腺炎','慢性胰腺炎表现','慢性胰腺炎（HCP）','慢性胰腺炎胰管内支架置入术后','慢性胰腺炎并胰管多发结石','特指慢性胰腺炎','慢性胰腺炎伴胰尾假性囊肿','慢性胰腺炎伴钙化','非酒精性慢性胰腺炎','胰体尾慢性胰腺炎','胰头部慢性胰腺炎','慢性胰腺炎伴胰头结石','胰管多发结石伴慢性胰腺炎','慢性胰腺炎伴胰头假性囊肿','慢性胰腺炎胰管切开取石术后','慢性胰腺炎伴胰体尾假性囊肿','慢性胰腺炎伴胰管扩张','胰头慢性胰腺炎伴假性囊肿形成','慢性胰腺炎伴反复急性发作','特发性慢性慢性胰腺炎','慢性胰腺炎伴胰腺钙化','慢性胰腺炎伴胰管多发性结石','肿块型慢性胰腺炎术后','慢性胰腺炎（脂源性）','慢性胰腺炎胰腺假性囊肿伴感染术后','胰管炎性狭窄并慢性胰腺炎','慢性胰腺炎并假性囊肿形成','胰腺结石伴慢性胰腺炎','慢性胰腺炎胰头十二指肠切除术后','慢性胰腺炎胰腺假性囊肿外引流术后','慢性胰腺炎伴胰管内多发结石','胰头慢性胰腺炎合并假性囊肿形成','慢性胰腺炎胰十二指肠+胆囊切除术后','局灶性慢性胰腺炎','慢性胰腺炎急性发作副胰管支架置入术后','慢性胰腺炎支架植入术后','慢性胰腺炎胰管空肠吻合术后','（胰头）慢性胰腺炎','局限性慢性胰腺炎','慢性胰腺炎后改变','慢性胰腺炎胰管支架置入置入术后','慢性胰腺炎胰腺假性囊肿引流术后','慢性胰腺炎伴导管上皮低级别上皮瘤变','慢性胰腺炎伴胰尾囊肿形成','慢性胰腺炎胰腺分裂胰管支架置入术后','慢性胰腺炎胰腺分裂胰管支架取出术后','胰头占位IPMN伴慢性胰腺炎','慢性胰腺炎胰管双支架置入术后','慢性胰腺炎急性发作伴小脓肿','慢性胰腺炎伴胰头部钙化','慢性胰腺炎胰管支架知置入术后','继发于慢性胰腺炎','慢性胰腺炎MRCP+胰管支架置入术后','慢性胰腺炎胰管置入术后','慢性胰腺炎脾切除+胰体尾切除术后','慢性胰腺炎伴部分导管上皮低级别上皮内瘤变','胰腺头部慢性胰腺炎伴导管上皮内瘤变','胰腺局灶性慢性胰腺炎','慢性胰腺炎伴胰周脂肪组织灶性液化性坏死','胰头慢性胰腺炎伴假性囊肿形成及急性活动','慢性胰腺炎伴导管高级别上皮内瘤变','胰体尾肿块型慢性胰腺炎伴少量导管低级别上皮内瘤变','慢性胰腺炎胆胰管支架植入术后','慢性胰腺炎ERCP胰管取石术后','外伤后慢性胰腺炎','胰头部慢性胰腺炎伴导管上皮内瘤变','慢性胰腺炎合并胰管结石','胰体尾局灶性慢性胰腺炎伴胰管慢性炎','慢性胰腺炎ERCP胆管塑料支架置入术后','慢性胰腺炎ERCP胰管塑料支架置入术后','胰体尾慢性胰腺炎伴假性囊肿形成','胰体尾部慢性胰腺炎','胰体尾假性囊肿伴慢性胰腺炎','慢性胰腺炎继发胆管狭窄','慢性胰腺炎胰管取石术+支架置入术后','慢性胰腺炎刺激腹膜后周围组织水肿','慢性胰腺炎征象','慢性胰腺炎急性发作ERCP+ERT+胰管支架置入术后','慢性胰腺炎（肿块性）','自身免疫性慢性胰腺炎','慢性胰腺炎伴纤维包块形成','胰头肿块性慢性胰腺炎','慢性胰腺炎伴急性发作','慢性胰腺炎并发胰腺假性囊肿','慢性胰腺炎伴发假性囊肿感染','慢性胰腺炎术','胰头局灶性慢性胰腺炎伴胆总管粘膜慢性炎','胰体慢性胰腺炎伴部分导管上皮低级别上皮内瘤变','胰腺肿瘤','胰腺恶性肿瘤','胰腺癌术后','胰腺癌多发转移','胰腺癌术后复发','c胰腺癌','胰腺癌伴多发转移','胰腺癌放疗后','胰腺癌术后多发转移','胰腺癌术后化疗','胰腺癌肝转移术后','胰腺癌化疗后','胰腺癌胆管支架置入术后','胰腺肿瘤术后','胰腺癌伴转移','胰腺癌伴梗阻性黄疸','胰腺癌姑息术后','胰腺癌侵犯胆管','转移性胰腺癌','胰腺癌伴多处转移','胰腺癌肝转移姑息术后','胰腺癌胆道支架置入术后','胰腺癌粒子置入术后','胰腺癌肝转移化疗后','胰腺癌并多发转移','胰腺癌伴肝、胃、脾、淋巴结转移姑息术后','胰腺癌剖腹探查术后','胰腺恶性肿瘤术后','胰腺癌化疗术后','胰腺癌伴癌性胸水','胰腺癌术后改变','胰腺癌金属支架置入术后','胰腺癌神经内分泌癌术后','胰腺肿瘤切除术后','胰腺癌伴广泛转移','胰腺癌粒子植入术后','小胰腺癌','胰腺癌并胆道梗阻','胰腺癌胆肠吻合术后','胰腺癌PTCD术后','胰腺癌（放疗、化疗术后）','胰腺癌伴十二指肠降部狭窄','胰腺癌γ刀术后','胰腺癌伴肝转移TACE术后放疗后','胰腺癌术','胰腺癌支架植入术后','胰腺癌广泛转移','胰腺癌综合治疗术后','胰腺癌卵巢转移术后','胰腺癌伴肝脏多发转移术后','胰腺癌伽马刀治疗术后','胰腺癌胆管粒子支架置入术后','胰腺癌瘤体内H101注射术后','胰腺癌放疗术后','胰腺癌IV期术后转移（腹膜后淋巴结）','胰腺癌伴肝转移ERCP+支架植入术后','胰腺癌伴肝转移姑息术后','继发性糖尿病胰腺癌术后','胰腺癌r刀术后','胰腺癌伴左肾、肾上腺转移姑息术后','胰腺癌伴肝内多发转移性肿瘤','胰腺癌节段切除胰肠吻合术后复发','胰腺癌胰腺癌放疗术后','胰腺癌伴腹腔多发转移姑息术后','胰腺癌胆道及十二指肠支架置入术后','胰腺癌放化疗后金标置入术后','胰腺癌支架置入术后','胰腺癌金标置入术','胰腺癌胆总管支架置入术后','胰腺癌侵犯十二指肠胆管支架置入术后','胰腺癌钩突中分化导管腺癌姑息术后','胰腺恶性肿瘤伴多发转移（肝、骨、左肾上腺、腹膜后淋巴结、腹膜）','胰腺恶性肿瘤伴转移','胰腺癌伴全身多发转移胆道金属支架置入术后','胰腺癌（腺癌）','胰腺癌PTCD胆管金属支架置入术后','胰腺癌多发转移术后','胰头颈部胰腺癌','胰腺癌胆管金属+塑料支架置入术后','胰腺癌金标植入术后','胰腺癌T3N1M0射频术后','胰腺癌胆道粒子支架置入术后','胰尾部胰腺癌','胰腺癌T3N1M0射频消融术后','胰腺癌伴肝转移肝转移病灶粒子植入术后','胰腺占位（胰腺癌）','胰腺癌放射性粒子置入术后','胰腺癌伴十二指肠受侵','胰腺癌（T2N0M1）腹腔神经节阻滞术后','胰腺癌PTCD后金属支架置入术PTCD术后','胰腺癌广泛转移合并胆道感染','胰体部胰腺癌','胰腺癌并肝脏、肠系膜转移剖腹探查术后','胰腺癌肝转移（多发）','胰腺癌（胆管支架置入术后）','胰腺癌伴腹腔、骨转移胆管支架置入术后','胰腺癌胆、胰管支架置入术后','胰腺癌并肺转移胆管金属支架置入术后','胰腺癌瘤体内金标植入术后','胰腺癌胆胰管支架置入术后','胰腺癌（T4N1M0）金标置入术后','胰腺癌ERCP+胆道支架置入术后+PTCD术后','胰腺癌中低分化腺癌','胰腺癌（T4N0M0）胆管金属支架置入术后','胰腺恶性肿瘤术后复发','胰颈部胰腺癌','胰腺癌肝转移胰管支架置入术后','胰头部胰腺癌','胰腺癌肝转移ERCP术后','胰腺癌介入治疗后','胰腺癌FNA+CPN+金标植入术后','胰腺癌金属支架植入术后','胰腺癌第一次化疗术后','胰腺癌超声内镜下金标植入术后','胰腺癌金标置入术后','胰腺癌腹腔积液十二指肠支架植入术后','胰腺癌（T2N1M0）胆管支架置入术后','胰腺癌合并胆管恶性梗阻胆总管金属支架置入术后','胰腺癌ERCP+胆管塑料支架取出+胆道清理术+胆管金属支架置入术后','胰腺癌（T2N1M0）胆总管支架置入术后','胰腺癌射频术后','胰腺癌T3N1M1（肝、骨）IV期CPN术后','胰腺癌合并胰腺炎','胰腺癌超声内镜下神经节阻滞术后','胰腺癌术后复发伴多发转移','胰腺癌侵犯壶腹部术后复发','胰腺癌FNA+金标置入术后','胰腺肿瘤性病变','胰腺良性肿瘤','胰腺良性肿瘤术后','胰腺良性肿瘤切除术后','胰腺囊肿','胰腺囊肿术后','胰腺囊肿支架置入术后','胰腺囊肿引流术后','胰腺囊肿金属支架置入术后','胰腺囊肿切除术后','胰腺囊肿支架术后','假性胰腺囊肿','胰腺囊肿体外引流术后','胰腺假性囊肿胰腺囊肿金属支架置入术后','EUS引导下胰腺囊肿引流术后','胰腺囊肿内引流术后','胰腺囊肿支架引流术后','胰腺囊肿及胰体尾+脾切除术后','胰腺囊肿外引流术后','胰腺囊肿切开引流术后','胰腺囊肿空肠吻合术后','胰腺假性囊肿胰腺囊肿穿刺置管引流术后','胰腺假性囊肿胃壁胰腺囊肿支架引流术后','胰腺囊肿假性手术后状态','胰腺囊肿引流管置入术后','胰腺囊肿置管取出术','胰腺囊肿支架置入术（引流）']},'诊断状态':'是',"+ZD13SLE+"}";
    public static  String strZDLCShengyanCondition="{'诊断时间':{$exists:true,$regex:/^.{10,}$/},'诊断状态':'是',"+ZD13SLE;
    public static String strSLETangNiaoBCondition="{'诊断时间':{$exists:true,$regex:/^.{10,}$/},'标准诊断名':{$in:["+condZDTangNiaoB+"]},'诊断状态':'是',"+ZD13SLE+"}";


    //配置参数
    public static String strCLeiJiFenZuFileName="95系统累及分组标注表.xlsx";
}
